app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "hello my first message!"], ["created_at", Sat, 18 Apr 2015 15:01:49 UTC +00:00], ["updated_at", Sat, 18 Apr 2015 15:01:49 UTC +00:00], ["user_id", 8]]
---
  def create
  	@micropost = current_user.microposts.build(params[:micropost])
  	if @micropost.save