app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'junaramaki@example.com' LIMIT 1
---
	def create
		user = User.find_by_email(params[:session][:email].downcase)