app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = 8 ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 1
---
  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])

INSERT INTO "users" ("created_at", "email", "name", "password", "password_confirmation", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 14 Apr 2015 06:45:36 UTC +00:00], ["email", nil], ["name", nil], ["password", nil], ["password_confirmation", nil], ["updated_at", Tue, 14 Apr 2015 06:45:36 UTC +00:00]]
---
  def new
    @user = User.new

    if @user.save

INSERT INTO "users" ("created_at", "email", "name", "password", "password_confirmation", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "users" SET "name" = 'jun019', "email" = '0192@sample.com', "password" = 'foobar', "password_confirmation" = 'foobar', "updated_at" = '2015-04-14 06:46:59.905094' WHERE "users"."id" = 4
---
  def update
    @user = User.find(params[:id])


      if @user.update_attributes(params[:user])